[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:109:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.datereviewed && "Date Reviewed is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:109:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.datereviewed && "Date Reviewed is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
