[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:28:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReview tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:81:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="stars">Stars</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "stars"}
+          data-testid={testIdPrefix + ""}
           id="stars"
           type="text"
killedBy: MenuItemReview tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-stars"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:101:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="datereviewed">Date Reviewed </Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "datereviewed"}
+          data-testid={testIdPrefix + ""}
           id="datereviewed"
           type="datetime-local"
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReview-datereviewed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
