[Survived] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:43:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(`Menu Item Review Updated - id: ${menuItemReview.id}`);
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
