[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:23:24
   // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
   // Note that even this complex regex may still need some tweaks
 
-  const testIdPrefix = "MenuItemReview-";
+  const testIdPrefix = "";
 
   return (
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:27:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:27:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:44:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="itemid">Item id</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "itemId"}
+          data-testid={testIdPrefix + ""}
           id="itemid"
           type="text"
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReview-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:50:24
           isInvalid={Boolean(errors.itemid)}
           {...register("itemid", {
             required: "Item id is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters.",
-            },
+            maxLength: {},
           })}
         />
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:69:23
           type="text"
           isInvalid={Boolean(errors.revieweremail)}
           {...register("revieweremail", {
-            required: "Reviewer email is required.",
+            required: "",
           })}
         />
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:86:22
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
             required: "Stars are required.",
-            pattern: {
-              value: /[1-5]/,
-              message: "Stars must be within the range of 1-5.",
-            },
+            pattern: {},
           })}
         />
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be within the range of 1-5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:87:22
           {...register("stars", {
             required: "Stars are required.",
             pattern: {
-              value: /[1-5]/,
+              value: /[^1-5]/,
               message: "Stars must be within the range of 1-5.",
             },
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:88:24
             required: "Stars are required.",
             pattern: {
               value: /[1-5]/,
-              message: "Stars must be within the range of 1-5.",
+              message: "",
             },
           })}
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be within the range of 1-5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:116:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="comments">Comments</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "comments"}
+          data-testid={testIdPrefix + ""}
           id="comments"
           type="text"
killedBy: MenuItemReview tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-comments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:120:36
           id="comments"
           type="text"
           isInvalid={Boolean(errors.comments)}
-          {...register("comments", {
-            required: "Comments are required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters.",
-            },
-          })}
+          {...register("comments", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReview tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:133:57
         </Form.Control.Feedback>
       </Form.Group>
 
-      <Button type="submit" data-testid={testIdPrefix + "submit"}>
+      <Button type="submit" data-testid={testIdPrefix + ""}>
         {buttonLabel}
       </Button>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReview-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:140:37
       <Button
         variant="Secondary"
         onClick={() => navigate(-1)}
-        data-testid={testIdPrefix + "cancel"}
+        data-testid={testIdPrefix + ""}
       >
         Cancel
killedBy: MenuItemReview tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
