[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:45:17
 
     {
       Header: "Item id",
-      accessor: "itemid",
+      accessor: "",
     },
     {
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-itemid"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
