[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemid,
-      comments: menuItemReview.comments,
-      reviewerEmail: menuItemReview.revieweremail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.datereviewed,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
