[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:21:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/menuitemreviews`,
+      url: ``,
       params: {
         id,
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/menuitemreviews`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReview-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemid: menuItemReview.itemid,
-      comments: menuItemReview.comments,
-      revieweremail: menuItemReview.revieweremail,
-      stars: menuItemReview.stars,
-      datereviewed: menuItemReview.datereviewed,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Review Updated - id: 17 item id: 2 comments: updated reviewer email: new@ucsb.edu stars: 1 date reviewed: 2025-01-02T00:00"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:28:55
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemid: menuItemReview.itemid,
-      comments: menuItemReview.comments,
-      revieweremail: menuItemReview.revieweremail,
-      stars: menuItemReview.stars,
-      datereviewed: menuItemReview.datereviewed,
-    },
-  });
+  const objectToAxiosPutParams = (menuItemReview) => ({});
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Review Updated - id: 17 item id: 2 comments: updated reviewer email: new@ucsb.edu stars: 1 date reviewed: 2025-01-02T00:00"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:30:13
 
   const objectToAxiosPutParams = (menuItemReview) => ({
     url: "/api/menuitemreviews",
-    method: "PUT",
+    method: "",
     params: {
       id: menuItemReview.id,
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Review Updated - id: 17 item id: 2 comments: updated reviewer email: new@ucsb.edu stars: 1 date reviewed: 2025-01-02T00:00"
Received: "Menu Item Review Updated - id: 17 item id: 1 comments: good reviewer email: 7432@ucsb.edu stars: 4 date reviewed: 2025-01-01T00:00"

Number of calls: 1
