[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/menuitemreviews/all"],
-    { method: "GET", url: "/api/menuitemreviews/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: MenuItemReviewIndexPage tests renders three menu item reviews correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/menuitemreviews/all"],
-    { method: "GET", url: "/api/menuitemreviews/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: MenuItemReviewIndexPage tests renders three menu item reviews correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
