[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:47:46
               id="requesterEmail"
               type="email"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester Email is required.",
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests shows correct error messages on bad/missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:88:27
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
               {...register("tableOrBreakoutRoom", {
-                required: "Table or Breakout Room is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests shows correct error messages on bad/missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
