[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbdiningcommonsmenuitems/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdiningcommonsmenuitems/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:45:17
 
     {
       Header: "DiningCommonsCode",
-      accessor: "diningCommonsCode",
+      accessor: "",
     },
     {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:47:5
       Header: "DiningCommonsCode",
       accessor: "diningCommonsCode",
     },
-    {
-      Header: "Name",
-      accessor: "name",
-    },
+    {},
     {
       Header: "Station",
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:51:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Station",
-      accessor: "station",
-    },
+    {},
   ];
 
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
