[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:65:42
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
-          {...register("orgTranslation", {
-            required: "OrgTranslation is required.",
-          })}
+          {...register("orgTranslation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /OrgTranslation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:66:23
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
           {...register("orgTranslation", {
-            required: "OrgTranslation is required.",
+            required: "",
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /OrgTranslation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:81:36
           id="inactive"
           as="select"
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive", {
-            required: "Inactive is required.",
-          })}
+          {...register("inactive", {})}
         >
           <option value="">---</option>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:82:23
           as="select"
           isInvalid={Boolean(errors.inactive)}
           {...register("inactive", {
-            required: "Inactive is required.",
+            required: "",
           })}
         >
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
