[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:15:18
 export default function UCSBOrganizationTable({
   ucsborganizations,
   currentUser,
-  testIdPrefix = "UCSBOrganizationTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.values.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/ZPR"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.values.orgCode}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/ZPR"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:38:5
   };
 
   const columns = [
-    {
-      Header: "OrgCode",
-      accessor: "orgCode", // accessor is the "key" in the data
-    },
+    {},
 
     {
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:39:15
 
   const columns = [
     {
-      Header: "OrgCode",
+      Header: "",
       accessor: "orgCode", // accessor is the "key" in the data
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:40:17
   const columns = [
     {
       Header: "OrgCode",
-      accessor: "orgCode", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
     },
 
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:44:15
     },
 
     {
-      Header: "OrgTranslationShort",
+      Header: "",
       accessor: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgTranslationShort. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:49:17
     },
     {
       Header: "OrgTranslation",
-      accessor: "orgTranslation",
+      accessor: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationTable.js:54:17
     {
       Header: "Inactive",
       id: "inactive",
-      accessor: (row) => String(row.inactive),
+      accessor: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
