[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.values.orgCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
